app/controllers/urls_controller.rb

INSERT INTO "urls" ("created_at", "original_url", "updated_at", "url_digest", "visit_count") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 18 Feb 2014 19:34:16 UTC +00:00], ["original_url", "www.royshlee.com"], ["updated_at", Tue, 18 Feb 2014 19:34:16 UTC +00:00], ["url_digest", nil], ["visit_count", 0]]
SELECT "urls".* FROM "urls" WHERE "urls"."url_digest" = 'ed7254' LIMIT 1
UPDATE "urls" SET "visit_count" = 1, "updated_at" = '2014-02-18 19:50:49.322798' WHERE "urls"."id" = 2
---
  def create
    original_url = format_url(params[:url][:original_url])
    url_digest = create_digest(original_url)
    @url = Url.where(url_digest: url_digest).first_or_create(original_url: original_url)
      if @url.valid?
        @url.visit_count += 1
        @url.save

SELECT "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT 1  [["id", "4"]]
---
  def show
    @url = Url.find params[:id]

SELECT "urls".* FROM "urls" WHERE "urls"."url_digest" = 'ed7254' LIMIT 1
---
  def go
    @url = Url.where(url_digest: params[:url_digest]).first